       IDENTIFICATION DIVISION.
       PROGRAM-ID. ANSWER-TO-UNIVERSE.
       DATA DIVISION.
       LINKAGE SECTION.

       01  OUT-ANSWER    PIC X(10).

       PROCEDURE DIVISION USING
           BY REFERENCE OUT-ANSWER.
           STRING "36" INTO OUT-ANSWER
           SET RETURN-CODE TO 1.


       END PROGRAM ANSWER-TO-UNIVERSE.
