       IDENTIFICATION DIVISION.

       PROGRAM-ID. ANSWER-TO-LIFE.

       DATA DIVISION.

       LINKAGE SECTION.

       01  OUT-ANSWER    PIC X(10).


       PROCEDURE DIVISION USING
           BY REFERENCE OUT-ANSWER.

           STRING "42" INTO OUT-ANSWER

           SET RETURN-CODE TO 1.



       END PROGRAM ANSWER-TO-LIFE.
